In [1]:
import pandas as pd
df = pd.read_excel('09.xlsx',sheet_name=0)
da = df.copy()

In [2]:
# 每列的nan
nan1 = df.isna().sum()
df.loc['NAN'] = nan1
df

     1D号   姓名   性别    语文    数学    英语
0    ID1   陈一  NaN  81.0  94.0  61.0
1    ID2  NaN    女   NaN   NaN  87.0
2    ID3   张三  NaN  83.0   NaN   NaN
3    ID4   李四    女  84.0  67.0  77.0
4    ID5   王五  NaN  85.0   NaN  79.0
5    ID6   罗六    女  86.0  69.0   NaN
6    ID7   安七  NaN  87.0  77.0  84.0
NAN    0    1    4   1.0   3.0   2.0

In [3]:
# 每行的nan
nan2 = df.isna().sum(axis=1)
df['NAN'] = nan2
df

     1D号   姓名   性别    语文    数学    英语  NAN
0    ID1   陈一  NaN  81.0  94.0  61.0    1
1    ID2  NaN    女   NaN   NaN  87.0    3
2    ID3   张三  NaN  83.0   NaN   NaN    3
3    ID4   李四    女  84.0  67.0  77.0    0
4    ID5   王五  NaN  85.0   NaN  79.0    2
5    ID6   罗六    女  86.0  69.0   NaN    1
6    ID7   安七  NaN  87.0  77.0  84.0    1
NAN    0    1    4   1.0   3.0   2.0    0

In [4]:
# 每列的非nan
nan1 = df.notna().sum()
df.loc['NAN'] = nan1
df

     1D号   姓名   性别    语文    数学    英语  NAN
0    ID1   陈一  NaN  81.0  94.0  61.0    1
1    ID2  NaN    女   NaN   NaN  87.0    3
2    ID3   张三  NaN  83.0   NaN   NaN    3
3    ID4   李四    女  84.0  67.0  77.0    0
4    ID5   王五  NaN  85.0   NaN  79.0    2
5    ID6   罗六    女  86.0  69.0   NaN    1
6    ID7   安七  NaN  87.0  77.0  84.0    1
NAN    8    7    4   7.0   5.0   6.0    8

In [5]:
# 每列的非nan
nan2 = df.notna().sum(axis=1)
df['NAN'] = nan2
df

     1D号   姓名   性别    语文    数学    英语  NAN
0    ID1   陈一  NaN  81.0  94.0  61.0    6
1    ID2  NaN    女   NaN   NaN  87.0    4
2    ID3   张三  NaN  83.0   NaN   NaN    4
3    ID4   李四    女  84.0  67.0  77.0    7
4    ID5   王五  NaN  85.0   NaN  79.0    5
5    ID6   罗六    女  86.0  69.0   NaN    6
6    ID7   安七  NaN  87.0  77.0  84.0    6
NAN    8    7    4   7.0   5.0   6.0    7

In [6]:
# 每列的nan占比 len(df)总行数
nan1 = df.isna().sum()/len(df) *100
df.loc['NAN'] = nan1
df

     1D号    姓名    性别    语文    数学    英语  NAN
0    ID1    陈一   NaN  81.0  94.0  61.0    6
1    ID2   NaN     女   NaN   NaN  87.0    4
2    ID3    张三   NaN  83.0   NaN   NaN    4
3    ID4    李四     女  84.0  67.0  77.0    7
4    ID5    王五   NaN  85.0   NaN  79.0    5
5    ID6    罗六     女  86.0  69.0   NaN    6
6    ID7    安七   NaN  87.0  77.0  84.0    6
NAN  0.0  12.5  50.0  12.5  37.5  25.0    0

In [7]:
# 每行的nan占比 df.shape[1]总列数
nan2 = df.isna().sum(axis=1)/df.shape[1] *100
df['NAN'] = nan2
df

     1D号    姓名    性别    语文    数学    英语        NAN
0    ID1    陈一   NaN  81.0  94.0  61.0  14.285714
1    ID2   NaN     女   NaN   NaN  87.0  42.857143
2    ID3    张三   NaN  83.0   NaN   NaN  42.857143
3    ID4    李四     女  84.0  67.0  77.0   0.000000
4    ID5    王五   NaN  85.0   NaN  79.0  28.571429
5    ID6    罗六     女  86.0  69.0   NaN  14.285714
6    ID7    安七   NaN  87.0  77.0  84.0  14.285714
NAN  0.0  12.5  50.0  12.5  37.5  25.0   0.000000

In [8]:
# 删除NAN值 how='any' 有就删
# axis=0 行
df.dropna(axis=0,how='any')

     1D号    姓名    性别    语文    数学    英语  NAN
3    ID4    李四     女  84.0  67.0  77.0  0.0
NAN  0.0  12.5  50.0  12.5  37.5  25.0  0.0

In [9]:
# axis=1 列
df.dropna(axis=1,how='any')

     1D号        NAN
0    ID1  14.285714
1    ID2  42.857143
2    ID3  42.857143
3    ID4   0.000000
4    ID5  28.571429
5    ID6  14.285714
6    ID7  14.285714
NAN  0.0   0.000000

In [10]:
# how='all' 全是nan删
# df.loc['7'] = ['NaN','NaN','NaN','NaN','NaN','NaN','NaN']
df.dropna(axis=0,how='all')

     1D号    姓名    性别    语文    数学    英语        NAN
0    ID1    陈一   NaN  81.0  94.0  61.0  14.285714
1    ID2   NaN     女   NaN   NaN  87.0  42.857143
2    ID3    张三   NaN  83.0   NaN   NaN  42.857143
3    ID4    李四     女  84.0  67.0  77.0   0.000000
4    ID5    王五   NaN  85.0   NaN  79.0  28.571429
5    ID6    罗六     女  86.0  69.0   NaN  14.285714
6    ID7    安七   NaN  87.0  77.0  84.0  14.285714
NAN  0.0  12.5  50.0  12.5  37.5  25.0   0.000000

In [11]:
# 填充nan值
# df.fillna(value=0)

In [12]:
# ffill 用前面的值填充 fillna已不再支持method
# df.fillna(method='ffill')
df.ffill()

     1D号    姓名    性别    语文    数学    英语        NAN
0    ID1    陈一   NaN  81.0  94.0  61.0  14.285714
1    ID2    陈一     女  81.0  94.0  87.0  42.857143
2    ID3    张三     女  83.0  94.0  87.0  42.857143
3    ID4    李四     女  84.0  67.0  77.0   0.000000
4    ID5    王五     女  85.0  67.0  79.0  28.571429
5    ID6    罗六     女  86.0  69.0  79.0  14.285714
6    ID7    安七     女  87.0  77.0  84.0  14.285714
NAN  0.0  12.5  50.0  12.5  37.5  25.0   0.000000

In [13]:
# ffill 用后面的值填充 fillna已不再支持method
df.bfill()

     1D号    姓名    性别    语文    数学    英语        NAN
0    ID1    陈一     女  81.0  94.0  61.0  14.285714
1    ID2    张三     女  83.0  67.0  87.0  42.857143
2    ID3    张三     女  83.0  67.0  77.0  42.857143
3    ID4    李四     女  84.0  67.0  77.0   0.000000
4    ID5    王五     女  85.0  69.0  79.0  28.571429
5    ID6    罗六     女  86.0  69.0  84.0  14.285714
6    ID7    安七  50.0  87.0  77.0  84.0  14.285714
NAN  0.0  12.5  50.0  12.5  37.5  25.0   0.000000

In [14]:
# 平均值填充
# df.fillna(df)
df[['语文','数学','英语']].mean().round(1)

语文    74.1
数学    68.9
英语    68.8
dtype: float64

In [15]:
df[['语文','数学','英语']] = df[['语文','数学','英语']].fillna(df[['语文','数学','英语']].mean().round(1))
df

     1D号    姓名    性别    语文    数学    英语        NAN
0    ID1    陈一   NaN  81.0  94.0  61.0  14.285714
1    ID2   NaN     女  74.1  68.9  87.0  42.857143
2    ID3    张三   NaN  83.0  68.9  68.8  42.857143
3    ID4    李四     女  84.0  67.0  77.0   0.000000
4    ID5    王五   NaN  85.0  68.9  79.0  28.571429
5    ID6    罗六     女  86.0  69.0  68.8  14.285714
6    ID7    安七   NaN  87.0  77.0  84.0  14.285714
NAN  0.0  12.5  50.0  12.5  37.5  25.0   0.000000

In [16]:
# 自定义函数填充
def fill_nan(x,col_name):
    if pd.isna(x):
        if col_name in ['姓名','性别']:
            return '不知名'
        return '缺考'
    return x
da1 = da.copy()
for col in da1.columns:
    # print(da[col])
    da1[col] = da1[col].apply(lambda x:fill_nan(x,col))

da1

   1D号   姓名   性别    语文    数学    英语
0  ID1   陈一  不知名  81.0  94.0  61.0
1  ID2  不知名    女    缺考    缺考  87.0
2  ID3   张三  不知名  83.0    缺考    缺考
3  ID4   李四    女  84.0  67.0  77.0
4  ID5   王五  不知名  85.0    缺考  79.0
5  ID6   罗六    女  86.0  69.0    缺考
6  ID7   安七  不知名  87.0  77.0  84.0

In [17]:
# mask填充
fill_values = {
    '1D号':'不知','姓名':'不知名','性别':'未知',
    '语文':'缺考','数学':'缺考','英语':'缺考'
}
da2 = da.copy()
for col in da2.columns:
    da2[col] = da2[col].mask(pd.isna(da2[col]),fill_values[col])

da2

   1D号   姓名  性别    语文    数学    英语
0  ID1   陈一  未知  81.0  94.0  61.0
1  ID2  不知名   女    缺考    缺考  87.0
2  ID3   张三  未知  83.0    缺考    缺考
3  ID4   李四   女  84.0  67.0  77.0
4  ID5   王五  未知  85.0    缺考  79.0
5  ID6   罗六   女  86.0  69.0    缺考
6  ID7   安七  未知  87.0  77.0  84.0

In [19]:
# groupby()填充
db = pd.read_excel('10.xlsx',sheet_name=0)
db

    班级  姓名 性别    语文    数学    英语
0  101  陈—  男  81.0  94.0  61.0
1  101  郑二  女   NaN  56.0   NaN
2  103  张三  男  83.0  87.0  99.0
3  102  李四  女  84.0   NaN  77.0
4  102  王五  男  85.0  61.0  79.0
5  103  罗六  女  86.0  69.0   NaN
6  101  安七  男  87.0  77.0  84.0
7  102  胡八  女  88.0  69.0   NaN
8  101  金久  男  89.0  97.0  76.0

In [23]:
def fill_group_nan(group):
    num_cols = ['语文','数学','英语']
    group[num_cols] = group[num_cols].fillna(round(group[num_cols].mean(),0))
    return group
dbf = db.groupby('班级').apply(fill_group_nan)
dbf

C:\Users\WZL\AppData\Local\Temp\ipykernel_11088\1267007421.py:5: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  dbf = db.groupby('班级').apply(fill_group_nan)

        班级  姓名 性别    语文    数学    英语
班级
101 0  101  陈—  男  81.0  94.0  61.0
    1  101  郑二  女  86.0  56.0  74.0
    6  101  安七  男  87.0  77.0  84.0
    8  101  金久  男  89.0  97.0  76.0
102 3  102  李四  女  84.0  65.0  77.0
    4  102  王五  男  85.0  61.0  79.0
    7  102  胡八  女  88.0  69.0  78.0
103 2  103  张三  男  83.0  87.0  99.0
    5  103  罗六  女  86.0  69.0  99.0

In [37]:
# 分组计算
ndb = db.fillna(80)
ndb[ndb['班级'] == 101]
for col in [101,102,103]:
    dfclass = ndb[ndb['班级'] == col]
    print(dfclass)

    班级  姓名 性别    语文    数学    英语
0  101  陈—  男  81.0  94.0  61.0
1  101  郑二  女  80.0  56.0  80.0
6  101  安七  男  87.0  77.0  84.0
8  101  金久  男  89.0  97.0  76.0
    班级  姓名 性别    语文    数学    英语
3  102  李四  女  84.0  80.0  77.0
4  102  王五  男  85.0  61.0  79.0
7  102  胡八  女  88.0  69.0  80.0
    班级  姓名 性别    语文    数学    英语
2  103  张三  男  83.0  87.0  99.0
5  103  罗六  女  86.0  69.0  80.0

In [41]:
# 计数
# dbf[['语文','数学','英语']].count()
ndb.groupby('班级')[['语文','数学','英语']].count()

     语文  数学  英语
班级
101   4   4   4
102   3   3   3
103   2   2   2

In [44]:
# 求和
ndb.groupby('班级')[['语文','数学','英语']].sum()

        语文     数学     英语
班级
101  337.0  324.0  301.0
102  257.0  210.0  236.0
103  169.0  156.0  179.0

In [47]:
# 平均值
round(ndb.groupby('班级')[['语文','数学','英语']].mean(),1)

       语文    数学    英语
班级
101  84.2  81.0  75.2
102  85.7  70.0  78.7
103  84.5  78.0  89.5

In [53]:
# 班级分组计算平均值进行填充
# transform 自动对准索引，自动填写
num_cols = ['语文','数学','英语']
df_f = db.copy()
for col in num_cols:
    col_mean = round(db.groupby('班级')[col].transform('mean'),1)
    df_f[col] = db[col].fillna(col_mean)
df_f

    班级  姓名 性别    语文    数学    英语
0  101  陈—  男  81.0  94.0  61.0
1  101  郑二  女  85.7  56.0  73.7
2  103  张三  男  83.0  87.0  99.0
3  102  李四  女  84.0  65.0  77.0
4  102  王五  男  85.0  61.0  79.0
5  103  罗六  女  86.0  69.0  99.0
6  101  安七  男  87.0  77.0  84.0
7  102  胡八  女  88.0  69.0  78.0
8  101  金久  男  89.0  97.0  76.0

In [63]:
# 高亮显示nan值
# db
# 创建样式对象
style_db = db.style
(
style_db.highlight_null(subset=['语文'],props="background:#00FFFF")
    .highlight_null(subset=['数学'],props="background:#FFE4B5")
    .highlight_null(subset=['英语'],props="background:#880808")
)